package com.company.timesheetwitcuba.entity;

import com.haulmont.chile.core.datatypes.impl.EnumClass;

import javax.annotation.Nullable;


public enum TypeDay implements EnumClass<String> {

    ЯВКА("Я"),
    ВЫХОДНОЙ("В"),
    ВЫХОД_В_ВЫХОДНОЙ("РП"),
    РАБОТАЛ_В_НОЧНОЕ_ВРЕМЯ("Н"),
    ВЫШЕЛ_В_ПРАЗДНИК_ИЛИ_ВЫХОДНОЙ("РВ"),
    ТРУДИЛСЯ_СВЕРУРОЧНО("С"),
    КОМАНДИРОВКА("К"),
    ПОВЫШАЛ_КВАЛИФИКАЦИЮ_С_ОТРЫВОМ_ОТ_ПРОИЗВОДСТВА("ПК"),
    ПОВЫШАЛ_КВАЛИФИКАЦИЮ("ПМ"),
    ПРОГУЛ("ПР"),
    ОТСУТВИЕ_НА_РАБОЧЕМ_МЕСТЕ("НН"),
    ОТСУТВИЕ_С_РАЗПЕШЕНИЯ_РАБОТОДАТЕЛЯ("А"),
    ЗАМЕЩЕНИЕ_В_1_3_КЛАССАХ("ЗН"),
    ЗАМЕЩЕНИЕ_В_ГРУППАХ_ПРОДЛ_ДНЯ("ЗП"),
    ЗАМЕЩЕНИЕ_В_4_11_КЛАССАХ("ЗС"),
    ОТПУСК("О"),
    ОСНОВНОЙ_ОТПУСК("ОТ"),
    ДОПОЛНИТЕЛЬНЫЙ_ОТПУСК("ОД"),
    УЧЕБНЫЙ_ОТПУСК1("У"),
    УЧЕБНЫЙ_ОТПУСК2("УВ"),
    УЧЕБНЫЙ_ДОП_ОТПУСК("ОУ"),
    ВЫХОДНЫЕ_В_СВЯЗИ_С_ОБУЧЕНИЕМ("ВУ"),
    ОТПУСК_ЗА_СВОЙ_СЧЕТ("ДО"),
    ДЕКРЕТНЫЙ_ОТПУСК("Р"),
    УХОД_ЗА_МАЛОЛЕТНИМ_РЕБЕНКОМ("ОР"),
    ОСУЩЕСТВЛЕНИЕ_ГОСУДАРСТВЕННЫХ_ОБЯЗАННОСТЕЙ("Г"),
    ЧАСЫ_ФАКТИЧЕСКИ_ОТРАБОТАННЫЕ("Ф"),
    БОЛЬНИЧНЫЙ("Б");

    private String id;

    TypeDay(String value) {
        this.id = value;
    }

    public String getId() {
        return id;
    }

    @Nullable
    public static TypeDay fromId(String id) {
        for (TypeDay at : TypeDay.values()) {
            if (at.getId().equals(id)) {
                return at;
            }
        }
        return null;
    }
}